In [1]:
import numpy as np

In [3]:
import pandas as pd

In [2]:
n=np.array([1,2,3,4,40])

In [4]:
x=pd.Series(n)

In [5]:
x

0     1
1     2
2     3
3     4
4    40
dtype: int32

In [6]:
type(x)

pandas.core.series.Series

In [8]:
b=pd.Series([1,2,[11,10],33,[12,23],47,58,100])

In [9]:
b

0           1
1           2
2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [10]:
b[3:7]

3          33
4    [12, 23]
5          47
6          58
dtype: object

In [11]:
b[2][0]

11

In [12]:
d=pd.Series({'a':10,'b':15,'c':56,'d':99})

In [13]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [14]:
d['d']

99

In [16]:
d['b':]

b    15
c    56
d    99
dtype: int64

In [17]:
s=pd.Series([12,52,42,10,23])

In [18]:
s

0    12
1    52
2    42
3    10
4    23
dtype: int64

In [19]:
s=pd.Series([12,52,42,10,23],index=['q','w','e','r','t'])

In [20]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [24]:
s1=pd.Series([12,52,42,10,23],index=list('qwert'))

In [25]:
s1

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [26]:
s2=pd.Series([12,52,12,52,10,23,42,10,23])

In [27]:
s2

0    12
1    52
2    12
3    52
4    10
5    23
6    42
7    10
8    23
dtype: int64

In [28]:
s2.value_counts()#count how many times a number is there in a series

12    2
52    2
10    2
23    2
42    1
dtype: int64

In [29]:
s2.argmax()#gives position of maximum value

1

In [30]:
s2.argmin()#gives position of minimum value

4

In [35]:
s1.idxmax()#gives name of index where max value is present

'w'

In [36]:
s1.idxmin()#gives name of index where min value is present

'r'

# DataFrame

In [37]:
a=pd.DataFrame()
b=pd.DataFrame([1,2,55,40,86])

In [38]:
a

Empty DataFrame
Columns: []
Index: []

In [39]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [40]:
type(b)

pandas.core.frame.DataFrame

In [44]:
c=pd.DataFrame([[1,2,3],[10,20,30],[7,8,9]])

In [45]:
c

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9

In [46]:
d=pd.DataFrame([[10,20,30,40,50],[1,2,3,4,5],[11,22,33,44,55],[11,12,13,14,15],[21,22,23,24,25]])

In [47]:
d

    0   1   2   3   4
0  10  20  30  40  50
1   1   2   3   4   5
2  11  22  33  44  55
3  11  12  13  14  15
4  21  22  23  24  25

In [48]:
d.head()#gives first 5 values

    0   1   2   3   4
0  10  20  30  40  50
1   1   2   3   4   5
2  11  22  33  44  55
3  11  12  13  14  15
4  21  22  23  24  25

In [49]:
d.tail()#gives last 5 values

    0   1   2   3   4
0  10  20  30  40  50
1   1   2   3   4   5
2  11  22  33  44  55
3  11  12  13  14  15
4  21  22  23  24  25

In [50]:
d.head(2)

    0   1   2   3   4
0  10  20  30  40  50
1   1   2   3   4   5

In [51]:
d.tail(1)

    0   1   2   3   4
4  21  22  23  24  25

In [53]:
d.sample()#gives data in random order(any one data)

    0   1   2   3   4
4  21  22  23  24  25

In [54]:
d.sample(3)

    0   1   2   3   4
3  11  12  13  14  15
4  21  22  23  24  25
1   1   2   3   4   5

In [74]:
d1=pd.DataFrame([[10,20,30,40],[1,np.nan,3,4,5],[11,22,'missing',44],[np.nan,12,13,14,15],[21,22,23,24]])

In [75]:
d1

      0     1        2   3     4
0  10.0  20.0       30  40   NaN
1   1.0   NaN        3   4   5.0
2  11.0  22.0  missing  44   NaN
3   NaN  12.0       13  14  15.0
4  21.0  22.0       23  24   NaN

In [78]:
d2=pd.DataFrame([[10,20,30,40],[1,np.nan,3,4,5],[11,22,'missing',44],[np.nan,12,13,14,15],[21,22,23,24]],columns=['colA','colB','colC','colD','colE'])

In [79]:
d2

   colA  colB     colC  colD  colE
0  10.0  20.0       30    40   NaN
1   1.0   NaN        3     4   5.0
2  11.0  22.0  missing    44   NaN
3   NaN  12.0       13    14  15.0
4  21.0  22.0       23    24   NaN

In [81]:
d2['colB']

0    20.0
1     NaN
2    22.0
3    12.0
4    22.0
Name: colB, dtype: float64

In [83]:
d2[['colA','colB']]

   colA  colB
0  10.0  20.0
1   1.0   NaN
2  11.0  22.0
3   NaN  12.0
4  21.0  22.0

In [84]:
d2[['colA','colB']].head(3)

   colA  colB
0  10.0  20.0
1   1.0   NaN
2  11.0  22.0

In [85]:
d2[['colA','colB']][1:4]

   colA  colB
1   1.0   NaN
2  11.0  22.0
3   NaN  12.0

In [86]:
d2['colA'].max()

21.0

In [88]:
d2.shape

(5, 5)

In [94]:
d2['new_col1']=[12,45,77,44,88]

In [95]:
d2

   colA  colB     colC  colD  colE  new_col  new_col1
0  10.0  20.0       30    40   NaN       12        12
1   1.0   NaN        3     4   5.0       45        45
2  11.0  22.0  missing    44   NaN       77        77
3   NaN  12.0       13    14  15.0       44        44
4  21.0  22.0       23    24   NaN       88        88

In [98]:
d2['colF']=d2['new_col']+d2['new_col1']

In [99]:
d2

   colA  colB     colC  colD  colE  new_col  new_col1  colF
0  10.0  20.0       30    40   NaN       12        12    24
1   1.0   NaN        3     4   5.0       45        45    90
2  11.0  22.0  missing    44   NaN       77        77   154
3   NaN  12.0       13    14  15.0       44        44    88
4  21.0  22.0       23    24   NaN       88        88   176

In [100]:
f= d2['colF']>=50

In [101]:
d2[f]#now d2 is showing rows which have greater than 50 values in colF

   colA  colB     colC  colD  colE  new_col  new_col1  colF
1   1.0   NaN        3     4   5.0       45        45    90
2  11.0  22.0  missing    44   NaN       77        77   154
3   NaN  12.0       13    14  15.0       44        44    88
4  21.0  22.0       23    24   NaN       88        88   176